posts/2015-01-13-prayer-for-the-medicated-preacher.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: Prayer for the Medicated Preacher

To commemorate Mitch Randall's fine, although heavily drugged, preaching on May 11, 2014:

Loving Father,

We give thanks for the one who,\\
although (relatively) young,\\
complimented "Sarah"\\
even though her name is Laura;

Who, despite years of theological education,\\
urged the congregation to turn to the "Book of Moses;"

Who, having been unable to find Sarah\\
in the congregation,\\
tried in vain to find her in the Exodus story.

And so, just as your power was demonstrated by the\\
babbling of those accused of imbibing on Pentecost,\\
may your love and grace shine through the\\
fumbling of the one who may be\\
over-medicated,\\
but is\\
much appreciated.

/Amen/


#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]]
#+end_tagline
