docs/posts/2015-01-13-prayer-for-the-medicated-preacher.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for the Medicated Preacher</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for the Medicated Preacher</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
To commemorate Mitch Randall&rsquo;s fine, although heavily drugged, preaching on May 11, 2014:
</p>

<p>
Loving Father,
</p>

<p>
We give thanks for the one who,<br>
although (relatively) young,<br>
complimented &ldquo;Sarah&rdquo;<br>
even though her name is Laura;
</p>

<p>
Who, despite years of theological education,<br>
urged the congregation to turn to the &ldquo;Book of Moses;&rdquo;
</p>

<p>
Who, having been unable to find Sarah<br>
in the congregation,<br>
tried in vain to find her in the Exodus story.
</p>

<p>
And so, just as your power was demonstrated by the<br>
babbling of those accused of imbibing on Pentecost,<br>
may your love and grace shine through the<br>
fumbling of the one who may be<br>
over-medicated,<br>
but is<br>
much appreciated.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org3bec02c">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
